def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a и b.

            Параметры:
                    a (число): длина первой стороны прямоугольника
                    b (число): длина второй стороны прямоугольника
            
            Возвращаемое значение:
                    a * b (число): площадь прямоугольника со сторонами a и b
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a и b.

            Параметры:
                    a (число): длина первой стороны прямоугольника
                    b (число): длина второй стороны прямоугольника
            
            Возвращаемое значение:
                    a + b + a + b (число): периметр прямоугольника со сторонами a и b
    '''
    return a + b + a + b
