def area(a):
    '''
    Возвращает площадь квадрата со стороной a.

            Параметры:
                    a (число): длина стороны квадрата
            
            Возвращаемое значение:
                    a * a (число): площадь квадрата со стороной a
    '''
    return a * a

def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.

            Параметры:
                    a (число): длина стороны квадрата
            
            Возвращаемое значение:
                    4 * a (число): периметр квадрата со стороной a
    '''
    return 4 * a
